samdonnelly/STM32F4-driver-library/sources/devices/nrf24l01_driver.cpp
    // Common between both PRX and PTX devices 

    // CONFIG - power up the device and default to a PRX device - delay for start up state 
    nrf24l01_config_reg_write(); 
    tim_delay_ms(nrf24l01_driver_data.timer, NRF24L01_START_DELAY); 
    
    // EN_AA - disable auto acknowledgment - set 0 
    nrf24l01_reg_write(NRF24L01_REG_EN_AA, NRF24L01_DISABLE_REG); 
    
    // EN_RXADDR - disable data pipes - set 0 
    nrf24l01_reg_write(NRF24L01_REG_EN_RXADDR, NRF24L01_DISABLE_REG); 
    reg_buff = nrf24l01_reg_read(NRF24L01_REG_EN_RXADDR); 
    
    // SETUP_AW - stays at the default of 5 bytes 
    
    // SETUP_RETR - not using auto acknowledgement so no need for retransmission - set 0 
    nrf24l01_reg_write(NRF24L01_REG_SETUP_RETR, NRF24L01_DISABLE_REG); 
    
    // RF_CH - set the channel 
    nrf24l01_rf_ch_reg_write(); 
    
    // RF_SET - set as needed - try different power outputs and data rates 
    nrf24l01_rf_set_reg_write(); 
    
    // STATUS - should be no need to write again 
    
    // OBSERVE_TX - nothing needed 
    
    // RDP - nothing needed 
    
    // RX_ADDR_PX - later 
    
    // TX_ADDR - later 
    
    // RX_PW_PX - later 
    
    // FIFO_STATUS - nothing to be done 
    
    // DYNPD - nothing needed 
    
    // FEATURE - nothing needed 

    //==================================================

    // Set CE high to enter RX mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_HIGH); 
}


// Configure a devices PTX settings 
void nrf24l01_ptx_config(
    const uint8_t *tx_addr)
{
    // Set CE low to exit any active mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_LOW); 

    // Set RF_CH - handled as a separate setter and in the init 
    
    // Set up TX_ADDR - don't need to match RX_ADDR_P0 as not using auto acknowledge 
    nrf24l01_write(NRF24L01_CMD_W_REG | NRF24L01_REG_TX_ADDR, tx_addr, NRF24l01_ADDR_WIDTH); 

    // Set CE high to enter back into an active mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_HIGH); 
}


// Configure a devices PRX settings 
void nrf24l01_prx_config(
    const uint8_t *rx_addr, 
    nrf24l01_data_pipe_t pipe_num)
{
    // Set CE low to exit any active mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_LOW); 

    // Set RF_CH - handled as a separate setter and in the init 

    // EN_RXADDR - set the data pipe to enable 
    nrf24l01_reg_write(
        NRF24L01_REG_EN_RXADDR, 
        nrf24l01_reg_read(NRF24L01_REG_EN_RXADDR) | (SET_BIT << (uint8_t)pipe_num)); 

    // RX_ADDR_PX - set the chosen data pipe address 
    // TODO this will only work for pipes 0 and 1 --> 2-5 are one byte 
    //      Could have another function that gets called from here but only for 2-5 and if 2-5 is 
    //      requested then the first 4 bytes of 1 are also updated. 
    nrf24l01_write(
        NRF24L01_CMD_W_REG | (NRF24L01_REG_RX_ADDR_P0 + (uint8_t)pipe_num), 
        rx_addr, 
        NRF24l01_ADDR_WIDTH); 

    // RX_PW_PX - set the max number of bytes in RX payload in the chosen data pipe 
    nrf24l01_reg_write(
        (NRF24L01_REG_RX_PW_P0 + (uint8_t)pipe_num), 
        NRF24L01_MAX_PAYLOAD_LEN); 

    // Set CE high to enter back into an active mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_HIGH); 
}

//=======================================================================================


//=======================================================================================
// Write and read 

// Send data to another transceiver 
void nrf24l01_write(
    uint8_t cmd, 
    const uint8_t *send_buff, 
    uint8_t data_len)
{
    // Local variables 
    uint8_t spi_status = SPI_OK; 
    uint8_t status_reg = CLEAR; 

    // Select slave 
    spi_slave_select(nrf24l01_driver_data.gpio_ss, nrf24l01_driver_data.ss_pin); 

    // Write the command and read the status back from the slave 
    spi_status = (uint8_t)spi_write_read(nrf24l01_driver_data.spi, 
                                         cmd, 
                                         &status_reg, 
                                         BYTE_1); 

    // Write the data to the device 
    spi_status = (uint8_t)spi_write(nrf24l01_driver_data.spi, 
                                    send_buff, 
                                    data_len); 

    // Deselect slave 
    spi_slave_deselect(nrf24l01_driver_data.gpio_ss, nrf24l01_driver_data.ss_pin); 

    // Update the status register data record 
    nrf24l01_status_reg_update(status_reg); 

    // Update the driver status 
    nrf24l01_driver_data.driver_status |= spi_status; 
}


// Register write 
void nrf24l01_reg_write(
    uint8_t cmd, 
    uint8_t reg_write)
{
    nrf24l01_write(NRF24L01_CMD_W_REG | cmd, &reg_write, BYTE_1); 
}


// Receive data from another transceiver 
void nrf24l01_receive(
    uint8_t cmd, 
    uint8_t *rec_buff, 
    uint8_t data_len)
{
    // Local variables 
    uint8_t spi_status = SPI_OK; 
    uint8_t status_reg = CLEAR; 

    // Select slave 
    spi_slave_select(nrf24l01_driver_data.gpio_ss, nrf24l01_driver_data.ss_pin); 

    // Write the command and read the status back from the slave 
    spi_status = (uint8_t)spi_write_read(nrf24l01_driver_data.spi, 
                                         cmd, 
                                         &status_reg, 
                                         BYTE_1); 

    // Dummy write while reading the returned info 
    spi_status = (uint8_t)spi_write_read(nrf24l01_driver_data.spi, 
                                         NRF24L01_DUMMY_WRITE, 
                                         rec_buff, 
                                         data_len); 

    // Deselect slave 
    spi_slave_deselect(nrf24l01_driver_data.gpio_ss, nrf24l01_driver_data.ss_pin); 

    // Update the status register data record 
    nrf24l01_status_reg_update(status_reg); 

    // Update the driver status 
    nrf24l01_driver_data.driver_status |= spi_status; 
}


// Register read 
uint8_t nrf24l01_reg_read(
    uint8_t cmd)
{
    // Read and return the register value 
    uint8_t reg_read = CLEAR; 
    nrf24l01_receive(NRF24L01_CMD_R_REG | cmd, &reg_read, BYTE_1); 
    return reg_read; 
}

//=======================================================================================


//=======================================================================================
// User functions 

// Send payload 
uint8_t nrf24l01_send_payload(
    const uint8_t *data_buff, 
    uint8_t data_len)
{
    // Local variables 
    // uint8_t pack_buff[NRF24L01_MAX_PAYLOAD_LEN]; 
    // uint8_t data_len = CLEAR; 
    // uint8_t index = NRF24L01_DATA_SIZE_LEN; 
    uint8_t buff = CLEAR;   // dummy variable to pass to the send function 
    uint8_t result = CLEAR; 
    uint16_t time_out = 0xFFFF; 

    // // Fill the packet buffer with the data to be sent. The packet will be capped at a max of 
    // // 30 data bytes with one byte always being saves at the beginning and end of the packet for 
    // // the data length and a NULL termination, respectfully. The following loop counts the data 
    // // length and saves the data/payload into the packet buffer. If the data length is less than 
    // // 30 bytes then the loop ends early. 
    // while (index <= NRF24L01_MAX_DATA_LEN)
    // {
    //     data_len++; 

    //     if (*data_buff == NULL_CHAR)
    //     {
    //         break; 
    //     }

