samdonnelly/STM32F4-driver-library/sources/devices/nrf24l01_driver.cpp
    //     pack_buff[index++] = *data_buff++; 
    // }

    // // Write the data size to the packet buffer and terminate the payload 
    // pack_buff[0] = data_len; 
    // pack_buff[index] = NULL_CHAR; 

    
    // Set CE low to exit RX mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_LOW); 

    // Set as a PTX device 
    nrf24l01_set_data_mode(NRF24L01_TX_MODE); 

    // Write the payload to the TX FIFO 
    nrf24l01_write(NRF24L01_CMD_W_TX_PL, data_buff, data_len); 
    // nrf24l01_write(
    //     NRF24L01_CMD_W_TX_PL, 
    //     pack_buff, 
    //     data_len); 

    // Set CE high to enter TX mode and start the transmission 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_HIGH); 

    // Delay to ensure CE is high for the minumum amount of time 
    tim_delay_us(nrf24l01_driver_data.timer, 20); 

    // Set CE low so the device goes back to Standby-1 state after transmission 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_LOW); 

    // Check to see if the TX FIFO is empty - means data was transmitted 
    do 
    {
        nrf24l01_fifo_status_reg_read(); 
    }
    while(!(nrf24l01_driver_data.fifo_status.tx_empty) && (--time_out)); 

    if (time_out)
    {
        result = SET_BIT; 
    }

    // Flush the TX FIFO 
    nrf24l01_write(NRF24L01_CMD_FLUSH_TX, &buff, BYTE_0); 

    // Set to a PRX device 
    nrf24l01_set_data_mode(NRF24L01_RX_MODE); 

    // Set CE back high to enter RX mode 
    gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_HIGH); 

    return result; 
}


// Data ready status 
uint8_t nrf24l01_data_ready_status(
    nrf24l01_data_pipe_t pipe_num)
{
    nrf24l01_status_reg_read(); 
    return (nrf24l01_driver_data.status_reg.rx_dr && 
           (nrf24l01_driver_data.status_reg.rx_p_no & (uint8_t)pipe_num)); 
    // return nrf24l01_driver_data.status_reg.rx_dr; 
}


// Receive payload 
void nrf24l01_receive_payload(
    uint8_t *read_buff, 
    nrf24l01_data_pipe_t pipe_num)
{
    // Local variables 
    // uint8_t data_len = CLEAR; 
    uint8_t buff = CLEAR;   // dummy variable to pass to the send function 

    // Check FIFO status before attempting a read 
    // if (nrf24l01_driver_data.status_reg.rx_dr)
    if (nrf24l01_driver_data.status_reg.rx_dr && 
       (nrf24l01_driver_data.status_reg.rx_p_no & (uint8_t)pipe_num))
    {
        // // Read the first byte from the RX FIFO --> This is the data length 
        // nrf24l01_receive(
        //     NRF24L01_CMD_R_RX_PL, 
        //     &data_len, 
        //     BYTE_1); 

        // // Use the data length number to read the remaining RX FIFO data 
        // nrf24l01_receive(
        //     NRF24L01_CMD_R_RX_PL, 
        //     read_buff, 
        //     data_len); 

        // Read the contents from the RX FIFO 
        nrf24l01_receive(NRF24L01_CMD_R_RX_PL, read_buff, NRF24L01_MAX_PAYLOAD_LEN); 

        // Flush the RX FIFO to ensure old data is not read later 
        nrf24l01_write(NRF24L01_CMD_FLUSH_RX, &buff, BYTE_0); 

        // Clear the RX_DR bit in the STATUS register 
        nrf24l01_status_reg_write(); 
        nrf24l01_status_reg_read(); 
    }
}


// // Set frequency channel 
// void nrf24l01_set_channel(
//     uint8_t rf_ch_freq)
// {
//     nrf24l01_driver_data.rf_ch.rf_ch = rf_ch_freq & NRF24L01_RF_CH_MASK; 
//     nrf24l01_rf_ch_reg_write(); 
// }


// // Set RF data rate 
// void nrf24l01_set_rate(
//     nrf24l01_data_rate_t rate)
// {
//     nrf24l01_driver_data.rf_setup.rf_dr_low = (rate >> SHIFT_1) & NRF24L01_RF_DR_MASK; 
//     nrf24l01_driver_data.rf_setup.rf_dr_high = rate & NRF24L01_RF_DR_MASK; 
//     nrf24l01_rf_set_reg_write(); 
// }


// // Set power mode 
// void nrf24l01_set_pwr_mode(
//     nrf24l01_pwr_mode_t pwr_mode)
// {
//     // Set CE=0 to enter standby-1 state 
//     gpio_write(nrf24l01_driver_data.gpio_en, nrf24l01_driver_data.en_pin, GPIO_LOW); 

//     // Set PWR_UP=pwr_mode to the desired power mode 
//     nrf24l01_driver_data.config.pwr_up = (uint8_t)pwr_mode; 
//     nrf24l01_config_reg_write(); 

//     // Delay to allow for Startup time (~1.5ms) --> Only needed for exiting power down state 
//     tim_delay_ms(nrf24l01_driver_data.timer, NRF24L01_START_DELAY); 
// }

//=======================================================================================


//=======================================================================================
// Other functions 

// Set mode 
void nrf24l01_set_data_mode(
    nrf24l01_mode_select_t mode)
{
    // Write PRIM_RX=mode to the device 
    nrf24l01_driver_data.config.prim_rx = (uint8_t)mode; 
    nrf24l01_config_reg_write(); 

    // Delay to clear the device settling state 
    tim_delay_us(nrf24l01_driver_data.timer, NRF24L01_SETTLE_DELAY); 
}

//=======================================================================================


//=======================================================================================
// Register functions 

// CONFIG register write 
void nrf24l01_config_reg_write(void)
{
    // Format the data to send 
    uint8_t config = (nrf24l01_driver_data.config.unused_1    << SHIFT_7) | 
                     (nrf24l01_driver_data.config.mask_rx_dr  << SHIFT_6) | 
                     (nrf24l01_driver_data.config.mask_tx_ds  << SHIFT_5) | 
                     (nrf24l01_driver_data.config.mask_max_rt << SHIFT_4) | 
                     (nrf24l01_driver_data.config.en_crc      << SHIFT_3) | 
                     (nrf24l01_driver_data.config.crco        << SHIFT_2) | 
                     (nrf24l01_driver_data.config.pwr_up      << SHIFT_1) | 
                     (nrf24l01_driver_data.config.prim_rx); 

    // Send the data to the CONFIG register 
    nrf24l01_reg_write(NRF24L01_REG_CONFIG, config); 
}


// CONFIG register read 
uint8_t nrf24l01_config_reg_read(void)
{
    return nrf24l01_reg_read(NRF24L01_REG_CONFIG); 
}


// RF_CH register write 
void nrf24l01_rf_ch_reg_write(void)
{
    // Format the data to send 
    uint8_t rf_ch = (nrf24l01_driver_data.rf_ch.unused_1 << SHIFT_7) | 
                    (nrf24l01_driver_data.rf_ch.rf_ch); 

    // Send the data to the RF_CH register 
    nrf24l01_reg_write(NRF24L01_REG_RF_CH, rf_ch); 
}


// RF_SETUP register write 
void nrf24l01_rf_set_reg_write(void)
{
    // Format the data to send 
    uint8_t rf_set = (nrf24l01_driver_data.rf_setup.cont_wave  << SHIFT_7) | 
                     (nrf24l01_driver_data.rf_setup.unused_1   << SHIFT_6) | 
                     (nrf24l01_driver_data.rf_setup.rf_dr_low  << SHIFT_5) | 
                     (nrf24l01_driver_data.rf_setup.pll_lock   << SHIFT_4) | 
                     (nrf24l01_driver_data.rf_setup.rf_dr_high << SHIFT_3) | 
                     (nrf24l01_driver_data.rf_setup.rf_pwr     << SHIFT_1) | 
                     (nrf24l01_driver_data.rf_setup.unused_2); 

    // Send the data to the RF_SET register 
    nrf24l01_reg_write(NRF24L01_REG_RF_SET, rf_set); 
}


// STATUS register write 
void nrf24l01_status_reg_write(void)
{
    // Format the data to send 
    uint8_t status_reg = (nrf24l01_driver_data.status_reg.unused_1 << SHIFT_7) | 
                         (nrf24l01_driver_data.status_reg.rx_dr    << SHIFT_6) | 
                         (nrf24l01_driver_data.status_reg.tx_ds    << SHIFT_5) | 
                         (nrf24l01_driver_data.status_reg.max_rt   << SHIFT_4) | 
                         (nrf24l01_driver_data.status_reg.rx_p_no  << SHIFT_1) | 
                         (nrf24l01_driver_data.status_reg.tx_full); 

    // Send the data to the STATUS register 
    nrf24l01_reg_write(NRF24L01_REG_STATUS, status_reg); 
}


// STATUS register read 
void nrf24l01_status_reg_read(void)
{
    // Local variables 
    uint8_t buff = CLEAR;   // dummy variable to pass to the receive function 

