samdonnelly/STM32F4-driver-library/sources/devices/nrf24l01_driver.cpp
    // Read the STATUS register and update the data record using a "No Operation" 
    nrf24l01_receive(
        NRF24L01_CMD_NOP, 
        &buff, 
        BYTE_0); 
}


// STATUS register state update 
void nrf24l01_status_reg_update(
    uint8_t status)
{
    // Sort the status register byte into the data record 
    nrf24l01_driver_data.status_reg.unused_1 = (status & FILTER_BIT_7) >> SHIFT_7; 
    nrf24l01_driver_data.status_reg.rx_dr    = (status & FILTER_BIT_6) >> SHIFT_6; 
    nrf24l01_driver_data.status_reg.tx_ds    = (status & FILTER_BIT_5) >> SHIFT_5; 
    nrf24l01_driver_data.status_reg.max_rt   = (status & FILTER_BIT_4) >> SHIFT_4; 
    nrf24l01_driver_data.status_reg.rx_p_no  = (status & FILTER_4_LSB) >> SHIFT_1; 
    nrf24l01_driver_data.status_reg.tx_full  = (status & FILTER_BIT_0); 
}


// FIFO_STATUS register read 
void nrf24l01_fifo_status_reg_read(void)
{
    // Read the FIFO_STATUS register and update the data record 
    uint8_t fifo_status_buff = nrf24l01_reg_read(NRF24L01_REG_FIFO); 

    // Store the FIFO status register byte into the data record 
    nrf24l01_driver_data.fifo_status.unused_1 = (fifo_status_buff & FILTER_BIT_7) >> SHIFT_7; 
    nrf24l01_driver_data.fifo_status.tx_reuse = (fifo_status_buff & FILTER_BIT_6) >> SHIFT_6; 
    nrf24l01_driver_data.fifo_status.tx_full  = (fifo_status_buff & FILTER_BIT_5) >> SHIFT_5; 
    nrf24l01_driver_data.fifo_status.tx_empty = (fifo_status_buff & FILTER_BIT_4) >> SHIFT_4; 
    nrf24l01_driver_data.fifo_status.unused_2 = (fifo_status_buff & FILTER_4_LSB) >> SHIFT_2; 
    nrf24l01_driver_data.fifo_status.rx_full  = (fifo_status_buff & FILTER_BIT_1) >> SHIFT_1; 
    nrf24l01_driver_data.fifo_status.rx_empty = (fifo_status_buff & FILTER_BIT_0); 
}

//=======================================================================================


//=======================================================================================
// Test functions 

// Read all device registers to verify values 
void nrf24l01_read_all_reg(void)
{
    // Local variables 
    uint8_t reg_buff = CLEAR; 
    uint8_t addr_buff[NRF24l01_ADDR_WIDTH]; 

    // CONFIG register read 
    reg_buff = nrf24l01_config_reg_read(); 
    
    // EN_AA register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_EN_AA, &reg_buff, BYTE_1); 
    
    // EN_RXADDR register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_EN_RXADDR, &reg_buff, BYTE_1); 
    
    // SETUP_AW register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_SETUP_AW, &reg_buff, BYTE_1); 
    
    // SETUP_RETR register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_SETUP_RETR, &reg_buff, BYTE_1); 
    
    // RF_CH register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RF_CH, &reg_buff, BYTE_1); 
    
    // RF_SETUP register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RF_SET, &reg_buff, BYTE_1); 
    
    // STATUS register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_STATUS, &reg_buff, BYTE_1); 
    
    // OBSERVE_TX register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_OBSERVE_TX, &reg_buff, BYTE_1); 
    
    // RPD register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RPD, &reg_buff, BYTE_1); 
    
    // RX_ADDR_P0 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P0, addr_buff, BYTE_5); 
    
    // RX_ADDR_P1 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P1, addr_buff, BYTE_5); 
    
    // RX_ADDR_P2 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P2, &reg_buff, BYTE_1); 
    
    // RX_ADDR_P3 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P3, &reg_buff, BYTE_1); 
    
    // RX_ADDR_P4 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P4, &reg_buff, BYTE_1); 
    
    // RX_ADDR_P5 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_ADDR_P5, &reg_buff, BYTE_1); 
    
    // TX_ADDR register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_TX_ADDR, addr_buff, BYTE_5); 
    
    // RX_PW_P0 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P0, &reg_buff, BYTE_1); 
    
    // RX_PW_P1 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P1, &reg_buff, BYTE_1); 
    
    // RX_PW_P2 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P2, &reg_buff, BYTE_1); 
    
    // RX_PW_P3 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P3, &reg_buff, BYTE_1); 
    
    // RX_PW_P4 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P4, &reg_buff, BYTE_1); 
    
    // RX_PW_P5 register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_RX_PW_P5, &reg_buff, BYTE_1); 
    
    // FIFO_STATUS register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_FIFO, &reg_buff, BYTE_1); 
    
    // DYNPD register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_DYNPD, &reg_buff, BYTE_1); 
    
    // FEATURE register read 
    nrf24l01_receive(NRF24L01_CMD_R_REG | NRF24L01_REG_FEATURE, &reg_buff, BYTE_1); 
}

//=======================================================================================
